{
  "navigation": {
    "home": "Home",
    "services": "Services",
    "experience": "Experience",
    "contact": "Contact"
  },
  "home": {
    "greeting": "Hello, I'm Paulo!",
    "role": "Your",
    "fullstack": "FullStack",
    "web": "WEB",
    "freelancer": "Freelancer"
  },
  "about": {
    "title": "About Me",
    "intro": "Hello! I'm <strong>Paulo Rodrigues</strong>, a FullStack developer passionate about technology and innovation. With over 3 years of experience in web and mobile development. Currently, I work as a FullStack Developer at INNYX Educação and have the pleasure of transforming ideas into digital products that make a difference.",
    "experience": "My experience includes more than <strong>20 delivered projects</strong> as a freelancer, working with companies from various segments and developing everything from landing pages to complex management and e-commerce systems.",
    "linkBio": "Visit my",
    "linkBioText": "Link-Bio",
    "linkBioDescription": "to follow all my projects and news.",
    "skills": "Skills"
  },
  "companies": {
    "title": "Services Provided",
    "description": "Companies that trusted my work to develop their digital solutions"
  },
  "experience": {
    "title": "Professional Experience",
    "description": "My journey as a developer, contributing to innovative projects and technological solutions",
    "responsibilities": "Main responsibilities:",
    "current": "present",
    "fullTime": "Full-time",
    "freelance": "Freelance",
    "remote": "Remote",
    "onSite": "On-site",
    "positions": {
      "innyx": {
        "title": "FullStack Developer",
        "company": "INNYX Educação",
        "period": "Feb 2025 - present · 6 months",
        "description": "FullStack Web & Mobile Developer | Innyx Educação",
        "details": "Currently working as a FullStack Developer at Innyx Educação, actively contributing to the creation and maintenance of scalable and high-performance web and mobile applications. I work daily with technologies like Vue.js, Next.js, PHP, Node.js, React Native (Expo) and Python, developing complete solutions, from feature conception to production delivery.",
        "responsibilities": [
          "Development and maintenance of RESTful APIs and integrations between internal and external systems.",
          "Implementation of modern and responsive interfaces focused on performance and user experience.",
          "Application of Clean Code best practices and software architecture to ensure scalability and maintainability.",
          "Working together with product and design teams to deliver efficient and user-centered solutions.",
          "Continuous support and maintenance of internal systems and new projects, always seeking optimizations.",
          "Active participation in code reviews, backlog planning and continuous improvements in the development flow."
        ]
      },
      "encaixa": {
        "title": "FullStack Developer",
        "company": "Encaixa.ai",
        "period": "Jan 2024 - present · 1 year 7 months",
        "description": "At Encaixa.ai, I work as a developer responsible for transforming ideas into solid and efficient functionalities, contributing to the development and evolution of a modern platform centered on user experience.",
        "responsibilities": [
          "Creation and development of web pages, focusing on performance, responsiveness and alignment with the application's identity.",
          "Implementation of business rules based on functional and technical requirements, ensuring adherence to the product's strategic objectives.",
          "Integration of payment solutions in the backend, ensuring security and fluidity in the transaction experience.",
          "Development of RESTful APIs in Node.js, optimized for performance and easy maintenance.",
          "Creation of endpoints dedicated to webhooks, enabling effective communication between external and internal systems."
        ]
      },
      "freelance": {
        "title": "Freelance web developer",
        "company": "Freelance",
        "period": "Mar 2022 - present · 3 years 5 months",
        "description": "I work as a freelance developer with more than 20 successfully delivered projects, serving clients from various segments with personalized and efficient solutions. My experience ranges from developing complete applications from scratch to maintaining and evolving existing systems, always focusing on performance, usability and scalability.",
        "details": "Throughout this journey, I worked with a wide range of technologies and stacks, adapting the choice of tools to the specific needs of each project. Among them: JavaScript (Vue.js, React, Next.js), Node.js, PHP, Python, React Native, Expo, among others.",
        "responsibilities": [
          "End-to-end development of web and mobile systems.",
          "Creation of APIs, administrative panels, e-commerce, mobile applications and customized internal systems.",
          "Direct customer service, requirements gathering and post-delivery follow-up.",
          "Maintenance and optimization of legacy applications.",
          "Application of clean code best practices, versioning (Git), testing and security.",
          "Autonomous management of deadlines, scope and constant value delivery."
        ]
      },
      "icts": {
        "title": "Web developer",
        "company": "Grupo ICTS",
        "period": "Apr 2023 - Apr 2024 · 1 year 1 month",
        "description": "Web Developer | Grupo ICTS – R&D Area",
        "details": "I worked in the Research and Development (R&D) sector of Grupo ICTS, contributing directly to the creation and evolution of robust and scalable web solutions. I worked with a focus on innovation, delivery quality and development best practices.",
        "responsibilities": [
          "Development of web applications using Angular, Java and Node.js stacks.",
          "Creation and maintenance of RESTful APIs, ensuring fluid integration between systems and high performance in requests.",
          "Construction of reusable and modular components in Angular, promoting standardization and code reuse in different parts of the system.",
          "Use of PostgreSQL database, versioning with Git and containerization with Docker.",
          "Active participation in multidisciplinary squads, using agile methodologies such as Scrum and Kanban for organization, planning and continuous value delivery.",
          "Strong alignment with development best practices, documentation and code review."
        ],
        "conclusion": "This experience was fundamental for my technical and professional growth, especially in contexts that require scalability, teamwork and constant innovation."
      }
    }
  },
  "services": {
    "title": "Types of Services",
    "description": "I develop complete solutions for different business needs",
    "saas": {
      "title": "SaaS",
      "description": "Complete application"
    },
    "ecommerce": {
      "title": "E-commerce",
      "description": "Online Store"
    },
    "landingPage": {
      "title": "Landing Page",
      "description": "Sales/Institutional page"
    }
  },
  "contact": {
    "title": "Contact via WhatsApp",
    "name": "Name",
    "namePlaceholder": "Your name",
    "company": "Company",
    "companyPlaceholder": "Company name",
    "subject": "Subject",
    "subjectPlaceholder": "Message subject",
    "message": "Message",
    "messagePlaceholder": "Your message",
    "submit": "Send Message via WhatsApp"
  },
  "chat": {
    "hello": "Hello",
    "question": "What do you need?",
    "placeholder": "I want to get a quote!",
    "online": "Online"
  },
  "footer": {
    "copyright": "Paulo Rodrigues - FullStack Developer",
    "rights": "All rights reserved.",
    "language": "Language"
  }
}